### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/7e13f499-1b92-475f-9df0-142e66cc9909/terraform-bin show -no-color plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-5325ddce.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-5325ddce.js"
      + source_hash            = "5cbd032b29b45e1d0a6d16e96292a9fc"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-d70ea114.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-d70ea114.js"
      + source_hash            = "60f7200ac2f35057bafcea6f92ebcae1"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-af0b0e6e.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-af0b0e6e.js"
      + source_hash            = "504882fd9335a2a3e3d636628661d79a"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad247451.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-ad247451.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-ad247451.css"
      + source_hash            = "623d1343a7416bbbdbce909629e9939d"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad66df16.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-ad66df16.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-ad66df16.js"
      + source_hash            = "499bb3abadae7842e00e76ebcae1e2be"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-5ddb6fa0.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-5ddb6fa0.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-5ddb6fa0.js"
      + source_hash            = "e8004ffe09d3e370a2bf94f0fdae1cf1"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-92288b02.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-92288b02.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-92288b02.js"
      + source_hash            = "99a701886613b4206d1454de9f1075a2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-41022946.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartButtonFloat-41022946.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartButtonFloat-41022946.js"
      + source_hash            = "b3918b00cf6df8bf63acfab5536d284f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-b84267ff.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Terminal-b84267ff.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Terminal-b84267ff.js"
      + source_hash            = "767c45f65711e58cf52349c4b7a7809d"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-b7d43fd6.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index-b7d43fd6.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index-b7d43fd6.js"
      + source_hash            = "e81f9a76dc589c96abc2896bce6fd70c"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-70f69c98.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-70f69c98.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-70f69c98.js"
      + source_hash            = "b9e6cea64ca620c2cc6d52465f32d3c4"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      ~ source_hash            = "9094f0cb7e9ab095295e9ae4e938f836" -> "8e4eac00279831cb1885186d2ad4dc06"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 11 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
      - "5cbd032b29b45e1d0a6d16e96292a9fc",
      - "60f7200ac2f35057bafcea6f92ebcae1",
      - "504882fd9335a2a3e3d636628661d79a",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "d254e9f4850a323e5ea30df3ac31964d",
      - "623d1343a7416bbbdbce909629e9939d",
      - "499bb3abadae7842e00e76ebcae1e2be",
      + (known after apply),
      + (known after apply),
        "e24945a32789e1abf50be49be251389e",
      - "e8004ffe09d3e370a2bf94f0fdae1cf1",
      - "99a701886613b4206d1454de9f1075a2",
      - "b3918b00cf6df8bf63acfab5536d284f",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "fff573f20a9b2c51b01a41b063cbf6bd",
        "85561bf1ef41088b8c3f0f50a6a1fa81",
      - "767c45f65711e58cf52349c4b7a7809d",
      + (known after apply),
        "e60911495dba8bb96def57539a94e9cf",
        # (13 unchanged elements hidden)
        "056b4c93c0fc46fc6fee5d5c316171b9",
      - "e81f9a76dc589c96abc2896bce6fd70c",
      - "b9e6cea64ca620c2cc6d52465f32d3c4",
      + (known after apply),
      + (known after apply),
        "3af47f89e61fe763b909c1fabc4c4083",
        # (10 unchanged elements hidden)
    ]
  ~ s3_bucket_object_ids         = [
      - "assets/About-5325ddce.js",
      - "assets/ArticleLayouts-d70ea114.js",
      - "assets/Articles-af0b0e6e.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/Articles-cdca7afd.css",
      - "assets/Landing-ad247451.css",
      - "assets/Landing-ad66df16.js",
      + (known after apply),
      + (known after apply),
        "assets/PDF-19838165.css",
      - "assets/PDF-5ddb6fa0.js",
      - "assets/Start-92288b02.js",
      - "assets/StartButtonFloat-41022946.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/StartButtonFloat-7308c767.css",
        "assets/Terminal-2e2ec67e.css",
      - "assets/Terminal-b84267ff.js",
      + (known after apply),
        "assets/azure_devicon_forest_green-ee780a3a.svg",
        # (13 unchanged elements hidden)
        "assets/index-9a0f5c31.css",
      - "assets/index-b7d43fd6.js",
      - "assets/index.es-70f69c98.js",
      + (known after apply),
      + (known after apply),
        "assets/powershell_devicon_forest_green-f06a1fda.svg",
        # (10 unchanged elements hidden)
    ]
  ~ s3_bucket_object_keys_ids    = [
      ~ {
          ~ id  = "assets/About-5325ddce.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
      ~ {
          ~ id  = "assets/ArticleLayouts-d70ea114.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
      ~ {
          ~ id  = "assets/Articles-af0b0e6e.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
        {
            id  = "assets/Articles-cdca7afd.css"
            key = "assets/Articles-cdca7afd.css"
        },
      ~ {
          ~ id  = "assets/Landing-ad247451.css" -> (known after apply)
            # (1 unchanged element hidden)
        },
      ~ {
          ~ id  = "assets/Landing-ad66df16.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
        {
            id  = "assets/PDF-19838165.css"
            key = "assets/PDF-19838165.css"
        },
      ~ {
          ~ id  = "assets/PDF-5ddb6fa0.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
      ~ {
          ~ id  = "assets/Start-92288b02.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
      ~ {
          ~ id  = "assets/StartButtonFloat-41022946.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
        {
            id  = "assets/StartButtonFloat-7308c767.css"
            key = "assets/StartButtonFloat-7308c767.css"
        },
        {
            id  = "assets/Terminal-2e2ec67e.css"
            key = "assets/Terminal-2e2ec67e.css"
        },
      ~ {
          ~ id  = "assets/Terminal-b84267ff.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
        {
            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"
            key = "assets/azure_devicon_forest_green-ee780a3a.svg"
        },
        # (13 unchanged elements hidden)
        {
            id  = "assets/index-9a0f5c31.css"
            key = "assets/index-9a0f5c31.css"
        },
      ~ {
          ~ id  = "assets/index-b7d43fd6.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
      ~ {
          ~ id  = "assets/index.es-70f69c98.js" -> (known after apply)
            # (1 unchanged element hidden)
        },
        {
            id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"
            key = "assets/powershell_devicon_forest_green-f06a1fda.svg"
        },
        # (10 unchanged elements hidden)
    ]
  ~ s3_bucket_object_version_ids = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
        "",
      + (known after apply),
        "",
        # (13 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (6 unchanged elements hidden)
        "",
      + (known after apply),
        "",
        "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-5325ddce.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/About-5325ddce.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/About-5325ddce.js"%0A      + source_hash            = "5cbd032b29b45e1d0a6d16e96292a9fc"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-d70ea114.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/ArticleLayouts-d70ea114.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/ArticleLayouts-d70ea114.js"%0A      + source_hash            = "60f7200ac2f35057bafcea6f92ebcae1"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-af0b0e6e.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Articles-af0b0e6e.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Articles-af0b0e6e.js"%0A      + source_hash            = "504882fd9335a2a3e3d636628661d79a"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad247451.css"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/css"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Landing-ad247451.css"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Landing-ad247451.css"%0A      + source_hash            = "623d1343a7416bbbdbce909629e9939d"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-ad66df16.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Landing-ad66df16.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Landing-ad66df16.js"%0A      + source_hash            = "499bb3abadae7842e00e76ebcae1e2be"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-5ddb6fa0.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/PDF-5ddb6fa0.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/PDF-5ddb6fa0.js"%0A      + source_hash            = "e8004ffe09d3e370a2bf94f0fdae1cf1"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-92288b02.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Start-92288b02.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Start-92288b02.js"%0A      + source_hash            = "99a701886613b4206d1454de9f1075a2"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-41022946.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/StartButtonFloat-41022946.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/StartButtonFloat-41022946.js"%0A      + source_hash            = "b3918b00cf6df8bf63acfab5536d284f"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-b84267ff.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Terminal-b84267ff.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Terminal-b84267ff.js"%0A      + source_hash            = "767c45f65711e58cf52349c4b7a7809d"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-b7d43fd6.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/index-b7d43fd6.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/index-b7d43fd6.js"%0A      + source_hash            = "e81f9a76dc589c96abc2896bce6fd70c"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-70f69c98.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/index.es-70f69c98.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/index.es-70f69c98.js"%0A      + source_hash            = "b9e6cea64ca620c2cc6d52465f32d3c4"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "index.html"%0A      ~ source_hash            = "9094f0cb7e9ab095295e9ae4e938f836" -> "8e4eac00279831cb1885186d2ad4dc06"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0APlan: 11 to add, 1 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  ~ s3_bucket_object_etags       = [%0A      - "5cbd032b29b45e1d0a6d16e96292a9fc",%0A      - "60f7200ac2f35057bafcea6f92ebcae1",%0A      - "504882fd9335a2a3e3d636628661d79a",%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A        "d254e9f4850a323e5ea30df3ac31964d",%0A      - "623d1343a7416bbbdbce909629e9939d",%0A      - "499bb3abadae7842e00e76ebcae1e2be",%0A      + (known after apply),%0A      + (known after apply),%0A        "e24945a32789e1abf50be49be251389e",%0A      - "e8004ffe09d3e370a2bf94f0fdae1cf1",%0A      - "99a701886613b4206d1454de9f1075a2",%0A      - "b3918b00cf6df8bf63acfab5536d284f",%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A        "fff573f20a9b2c51b01a41b063cbf6bd",%0A        "85561bf1ef41088b8c3f0f50a6a1fa81",%0A      - "767c45f65711e58cf52349c4b7a7809d",%0A      + (known after apply),%0A        "e60911495dba8bb96def57539a94e9cf",%0A        # (13 unchanged elements hidden)%0A        "056b4c93c0fc46fc6fee5d5c316171b9",%0A      - "e81f9a76dc589c96abc2896bce6fd70c",%0A      - "b9e6cea64ca620c2cc6d52465f32d3c4",%0A      + (known after apply),%0A      + (known after apply),%0A        "3af47f89e61fe763b909c1fabc4c4083",%0A        # (10 unchanged elements hidden)%0A    ]%0A  ~ s3_bucket_object_ids         = [%0A      - "assets/About-5325ddce.js",%0A      - "assets/ArticleLayouts-d70ea114.js",%0A      - "assets/Articles-af0b0e6e.js",%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A        "assets/Articles-cdca7afd.css",%0A      - "assets/Landing-ad247451.css",%0A      - "assets/Landing-ad66df16.js",%0A      + (known after apply),%0A      + (known after apply),%0A        "assets/PDF-19838165.css",%0A      - "assets/PDF-5ddb6fa0.js",%0A      - "assets/Start-92288b02.js",%0A      - "assets/StartButtonFloat-41022946.js",%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A        "assets/StartButtonFloat-7308c767.css",%0A        "assets/Terminal-2e2ec67e.css",%0A      - "assets/Terminal-b84267ff.js",%0A      + (known after apply),%0A        "assets/azure_devicon_forest_green-ee780a3a.svg",%0A        # (13 unchanged elements hidden)%0A        "assets/index-9a0f5c31.css",%0A      - "assets/index-b7d43fd6.js",%0A      - "assets/index.es-70f69c98.js",%0A      + (known after apply),%0A      + (known after apply),%0A        "assets/powershell_devicon_forest_green-f06a1fda.svg",%0A        # (10 unchanged elements hidden)%0A    ]%0A  ~ s3_bucket_object_keys_ids    = [%0A      ~ {%0A          ~ id  = "assets/About-5325ddce.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A      ~ {%0A          ~ id  = "assets/ArticleLayouts-d70ea114.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A      ~ {%0A          ~ id  = "assets/Articles-af0b0e6e.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A        {%0A            id  = "assets/Articles-cdca7afd.css"%0A            key = "assets/Articles-cdca7afd.css"%0A        },%0A      ~ {%0A          ~ id  = "assets/Landing-ad247451.css" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A      ~ {%0A          ~ id  = "assets/Landing-ad66df16.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A        {%0A            id  = "assets/PDF-19838165.css"%0A            key = "assets/PDF-19838165.css"%0A        },%0A      ~ {%0A          ~ id  = "assets/PDF-5ddb6fa0.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A      ~ {%0A          ~ id  = "assets/Start-92288b02.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A      ~ {%0A          ~ id  = "assets/StartButtonFloat-41022946.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A        {%0A            id  = "assets/StartButtonFloat-7308c767.css"%0A            key = "assets/StartButtonFloat-7308c767.css"%0A        },%0A        {%0A            id  = "assets/Terminal-2e2ec67e.css"%0A            key = "assets/Terminal-2e2ec67e.css"%0A        },%0A      ~ {%0A          ~ id  = "assets/Terminal-b84267ff.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A        {%0A            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"%0A            key = "assets/azure_devicon_forest_green-ee780a3a.svg"%0A        },%0A        # (13 unchanged elements hidden)%0A        {%0A            id  = "assets/index-9a0f5c31.css"%0A            key = "assets/index-9a0f5c31.css"%0A        },%0A      ~ {%0A          ~ id  = "assets/index-b7d43fd6.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A      ~ {%0A          ~ id  = "assets/index.es-70f69c98.js" -> (known after apply)%0A            # (1 unchanged element hidden)%0A        },%0A        {%0A            id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"%0A            key = "assets/powershell_devicon_forest_green-f06a1fda.svg"%0A        },%0A        # (10 unchanged elements hidden)%0A    ]%0A  ~ s3_bucket_object_version_ids = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A        "",%0A      + (known after apply),%0A      + (known after apply),%0A        "",%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A        "",%0A        "",%0A      + (known after apply),%0A        "",%0A        # (13 unchanged elements hidden)%0A        "",%0A      + (known after apply),%0A      + (known after apply),%0A        "",%0A        # (6 unchanged elements hidden)%0A        "",%0A      + (known after apply),%0A        "",%0A        "",%0A      - "",%0A      - "",%0A      - "",%0A      - "",%0A      - "",%0A      - "",%0A      - "",%0A      - "",%0A      - "",%0A      - "",%0A      - "",%0A      - "",%0A    ]%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*